-- 문제3 - 데이터 입력  
INSERT INTO Doctors
	VALUES (980312, '소아과', '이태성', 'M', '010-333-1340', 'ltj@naver.com' ,'과장')
		, (000601, '내과', '안성기', 'M', '010-222-0987', 'ask@naver.com' ,'과장')
        , (001208, '외과', '김민종', 'M', '010-333-8743', 'kmj@naver.com' ,'과장')
        , (020403, '피부과', '이태서', 'M', '010-777-3764', 'lts@naver.com' ,'과장')
        , (050900, '소아과', '김연아', 'F', '010-555-3764', 'kya@naver.com' ,'전문의')
        , (050101, '내과', '차태연', 'M', '010-222-7643', 'cth@naver.com' ,'전문의')
        , (062019, '소아과', '전지현', 'F', '010-999-1265', 'jh@naver.com' ,'전문의')
        , (070576, '피부과', '홍길동', 'M', '010-333-7263', 'hgd@naver.com' ,'전문의')
        , (080543, '방사선과', '유재석', 'M', '010-222-1263', 'yis@naver.com' ,'과장')
        , (091001, '외과', '김병만', 'M', '010-555-3542', 'kbm@naver.com' ,'전문의');
SELECT * FROM Doctors;

INSERT INTO Nurses
	VALUES (050302, '소아과', '김은영', 'F', '010-555-8751', 'key@naver.com' ,'수간호사')
		, (050021, '내과', '윤성애', 'F', '010-333-8745', 'ysa@naver.com' ,'수간호사')
        , (040089, '피부과', '신지원', 'M', '010-666-7646', 'sjw@naver.com' ,'주임')
        , (070605, '방사선과', '유정화', 'F', '010-333-4588', 'yjh@naver.com' ,'주임')
        , (070804, '내과', '라하나', 'F', '010-222-1340', 'nhn@naver.com' ,'주임')
        , (071018, '소아과', '김화경', 'F', '010-888-4116', 'khk@naver.com' ,'간호사')
        , (100356, '소아과', '이선용', 'M', '010-777-1234', 'lsy@naver.com' ,'간호사')
        , (104145, '외과', '김현', 'M', '010-999-8520', 'kh@naver.com' ,'간호사')
        , (120309, '피부과', '박성완', 'M', '010-777-4996', 'psw@naver.com' ,'간호사')
        , (130211, '외과', '이서연', 'F', '010-222-3214', 'lsy2@naver.com' ,'간호사');
SELECT * FROM Nurses;

INSERT INTO Patients
	VALUES (2345, 050302, 980312, '안성건' ,'M', '010-555-7845', 'ask@ab.com' ,'회사원');
-- 		, (3545, 040089, 020403, '김성룡','M', '010-333-7812', 'ksr@bb.com' ,'자영업')
--         , (3424, 070605, 080543, '이종진','M', '010-888-4859', 'ljj@ab.com' ,'회사원')
--         , (7675, 100356, 050900, '최광석','M', '010-222-4847', 'cks@cc.com' ,'회사원')
--         , (4533, 070804, 000601, '정한경','M', '010-777-9630', 'jhk@ab.com' ,'교수')
--         , (5546, 120309, 070576, '유원현','M', '010-777-0214', 'ywh@cc.com' ,'자영업')
--         , (4543, 070804, 050101, '최재정','M', '010-555-4187', 'cjj@bb.com' ,'회사원')
--         , (9768, 130211, 091001, '이진희','F', '010-888-3675', 'ljh@ab.com' ,'교수')
--         , (4234, 130211, 091001, '오나미','F', '010-999-6541', 'onm@cc.com' ,'학생')
--         , (7643, 071018, 062019, '송성묵','M', '010-222-5874', 'ssm@bb.com' ,'학생');
SELECT * FROM Patients;

-- 홍길동 의사가 맡고 있던 담당진료과목이 피부과에서 소아과로 변경되어 내일부터 진료를 시작할예정이다 이 정보에 대한 테이블 정보를 변경하시오.
UPDATE Doctors
   SET major_treat ='소아과'
 WHERE doc_name = '홍길동';

SELECT *
  FROM Doctors
 WHERE doc_name = '홍길동';

-- 리하나 간호사는 대학원 진학으로 오늘까지만 근무하고 퇴사하게 되었다. 이정보에 대한 테이블 정보를 변경하시오.
DELETE 
  FROM Nurses
 WHERE nur_name = '리하나';
 
SELECT * FROM Nurses;

-- 담당 진료과목이 '소아과'인 의사에 대한 정보를 출력하시오.
SELECT * 
  FROM Doctors
 WHERE major_treat = '소아과';


